icofoam-cases/cylinder-2d-Re=40-steady/system/blockMeshDict0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xrat    0.5;
ixrat   #calc "1.0/$xrat"; 
rat     0.25;
irat    #calc "1.0/$rat";

Len     0.4;
Height  0.02;
Theta   5.0;
RadTh   #calc "degToRad($Theta)";

z1      #calc "$Height * sin( $RadTh )";
y1      #calc "$Height * cos( $RadTh )"; 
z2      #calc "-$z1";

vertices
(
    ( 0.0  0.0      0.0 )
    ( $Len 0.0      0.0 )
    ( $Len $y1      $z1 )
    ( 0.0  $y1      $z1 )

    ( $Len $y1      $z2 )
    ( 0.0  $y1      $z2 )
);

blocks
(
   /* Cartesin to Cylindrical: (x,y,z) -> (z,theta,r) */
   //hex (0 1 1 0 3 2 4 5) (100 1 10) simpleGrading (1 1 1)
     hex (0 1 1 0 3 2 4 5) 
     (200 1 10) 
     simpleGrading 
     (
         $ixrat 1  $rat  
     )
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (3 2 4 5)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 5 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 4 2 1)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 5 4 1)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
